[{
  "Id": "1",
  "Title": "Check In",
  "Time": "8:00 am",
  "Speaker": "Check In",
  "SpeakerProfilePic": "img/icon.png",
  "Resumen": ""
}, {
  "Id": "2",
  "Title": "How I learned to Code by Making 180 websites in 180 days",
  "Time": "9:00 am",
  "Speaker": "Jennifer De Walt",
  "SpeakerProfilePic": "img/speakers/jennifer-dewalt.jpg",
  "Resumen": "With no real coding experience, I decided to sit down and teach myself to code by making one website a day, every day, for 180 days. In this session, I'll cover what inspired me to take the path of self directed learning and what challenges I faced along the way. The first websites I made were simple and only used a tiny bit of html and css. By the end I was making dynamic, interactive apps. In this talk I'll present a selection of some of my favorite websites from the project which include games, toys, physics simulations, data visualizations and real time communication apps."
}, {
  "Id": "3",
  "Time": "9:25 am",
  "Title": "ES6 Rocks!",
  "Speaker": "Jaydson Gomes",
  "SpeakerProfilePic": "img/speakers/jaydson-gomes.jpg",
  "Resumen": "ES6 is the sixth version of the language we love. The ECMAScript sixth version will be released in mid 2015, but all majors browsers are currently implementing the features we’ll have soon. In this talk you will know why ES6 Rocks! Also, you’ll learn how to write your code today with the new set of features and syntax both on node and the browser."
}, {
  "Id": "4",
  "Title": "Moving JS from Libraries to Polyfills",
  "Time": "9:50 am",
  "Speaker": "Sebastián Markbage",
  "SpeakerProfilePic": "img/speakers/sebastian-markbage.jpg",
  "Resumen": "I’ll explain how React is moving towards a minimal API surface area. Instead of providing many framework features, React is trying to utilize patterns, paradigms and JavaScript language features to accomplish the same tasks that other frameworks have dedicated APIs for. Not all environments have these natively. We need to polyfill new an experimental features. How can we safely do that? Is it better to have a non-standard library?"
}, {
  "Id": "5",
  "Title": "Break",
  "Time": "10:10 am",
  "Speaker": "Break",
  "SpeakerProfilePic": "img/icon.png",
  "Resumen": ""
}, {
  "Id": "6",
  "Title": "Making 3D Graphics Accessible",
  "Time": "10:45 am",
  "Speaker": "Mr Doob (Ricardo Cabello)",
  "SpeakerProfilePic": "img/speakers/ricardo-cabello.jpg",
  "Resumen": "In this session Ricardo will give some insights on how three.js came to be, some of the challenges from the past and the future and a few projects developed along the way."
}, {
  "Id": "7",
  "Title": "Parallax 101",
  "Time": "11:10 am",
  "Speaker": "María Evangelina Ferreira",
  "SpeakerProfilePic": "img/speakers/maria-evangelina-ferreira.jpg",
  "Resumen": "If a click is the decision, scrolling is a resolution. Parallax, moving content along with scroll pace, has become one of the most fashionable design tactics. It has dumped the ʺAbove the Foldʺ idea that people don't scroll by simply encouraging users to do so by entertaining them with movement and a sensation of depth. In this talk, we will go through real-time examples of Parallax animations, its anchors and its performance."
}, {
  "Id": "8",
  "Title": "Internationalize your web apps",
  "Time": "11:35 am",
  "Speaker": "Juan Ignacio Dopazo",
  "SpeakerProfilePic": "img/speakers/juan-ignacio-dopazo.jpg",
  "Resumen": "Traditionally, rendering of our web applications would be done on the server, where there are lots of established internationalization tools and libraries. However with the rise of single page apps (SPAs), user interfaces are being rendered in the browser using JavaScript. In this talk we'll be introducing FormatJS: a collection of JavaScript libraries for internationalization that are focused on formatting numbers, dates, and strings. We'll do a walkthrough of JavaScript's Intl API and some of the core libraries we've developed, as well as a set of integrations for Handlebars, Dust and React. Finally, we'll discuss how these tools can be useful even if your application is only written in one language."
}, {
  "Id": "9",
  "Title": "Visualizing data with JavaScript at Twitter",
  "Time": "12:00 am",
  "Speaker": "Nicolás García Belmonte",
  "SpeakerProfilePic": "img/speakers/nicolas-garcia.jpg",
  "Resumen": "At Twitter, the Visual Insights team has been working with the Media, Comms, Government and Brand Strategy teams on different visualizations for big events that happened around the world. Combining web standards, storytelling, data analysis and advanced graphics techniques we aim to translate into images the way people around the world have reacted on Twitter to an event. For our visualizations the Web is the best delivery platform and we use all graphics standards: 2D Canvas, WebGL, SVG and HTML based on the requirements of each visualization and accounting for factors like: number of elements in the screen, shape complexity, interaction, mobile support, libraries available and more. Through the exposition of some of our work, we will describe the workflow we use to create interactive public-facing visualizations at Twitter. We will go through a pipeline which includes stages of research of novel visualization techniques, design and planning for an event, data gathering and processing, prototyping and publishing visualizations."
}, {
  "Id": "10",
  "Title": "Lunch",
  "Time": "12:30 pm",
  "Speaker": "Lunch",
  "SpeakerProfilePic": "img/icon.png",
  "Resumen": ""
}, {
  "Id": "11",
  "Title": "From JS to manufacturing, a hardware journey",
  "Time": "1:35 pm",
  "Speaker": "Sara Chipps",
  "SpeakerProfilePic": "img/speakers/sara-chipps.jpg",
  "Resumen": "Hardware is fun to play with, but can it become your career? Learn about turning a weekend hobby into a lifetime of learning while building a hardware company from the ground up."
}, {
  "Id": "12",
  "Title": "JavaScript and Artificial Intelligence",
  "Time": "2:00 pm",
  "Speaker": "Angel \"Java\" Lopez",
  "SpeakerProfilePic": "img/speakers/angel-java-lopez.jpg",
  "Resumen": "Artificial Intelligence is a broad field with a long history of success and failures. We will explore some applications and algorithms, using JavaScript, at the browser and at the server with Node.js. The key topics to visit: using artificial intelligence in board games, genetic algorithms, neural networks, machine learning, deep learning. JavaScript is everywhere, and with the advent of Internet of Things, Big Data, robotics and drones, and distributed computing, there are more applications that applies artificial intelligence ideas."
}, {
  "Id": "13",
  "Title": "Else Considered Harmful",
  "Time": "2:25 pm",
  "Speaker": "Nikolai Bachiyski",
  "SpeakerProfilePic": "img/speakers/nikolai-bachiyski.jpg",
  "Resumen": "The \"if else\" logic is not entirely intuitive for our minds. We'll explore some alternatives that would lead to the same results but without using the more traditional logic sintax most of us are used to. We'll also see how we can benefit from reducing the complexity of our code in favour of readability, making it say what we really mean instead of having to translate all of our thoughts into a series of \"if else\" statements."
}, {
  "Id": "14",
  "Title": "Break",
  "Time": "3:00 pm",
  "Speaker": "Break",
  "SpeakerProfilePic": "img/icon.png",
  "Resumen": ""
}, {
  "Id": "15",
  "Title": "Your Very Own Component Library",
  "Time": "3:35 pm",
  "Speaker": "Alex Sexton",
  "SpeakerProfilePic": "img/speakers/alex-sexton.jpg",
  "Resumen": "We're all pretty big fans of Bootstrap. It's a component library that helps us turn our ideas into reality faster than we've ever been able to do in the past. Unfortunately, it's kind of bland (on purpose!), and all the sites on the internet are starting to look the same. At Stripe, we wanted the same power of being able to spin up projects quickly, but without using Bootstrap, specifically. So we made \"Bootstripe\". It's able to be much more opinionated, and allows lots of parallel developers to build consistent user interfaces. I'd love to tell you how to build your own, how to test it, and how to integrate it into your applications."
}, {
  "Id": "16",
  "Title": "Writing a Webmodule",
  "Time": "4:00 pm",
  "Speaker": "Nathan Rajlich",
  "SpeakerProfilePic": "img/speakers/nathan-rajlich.jpg",
  "Resumen": "How to write small, focused modules for use in the web browser, with automated cloud testing."
}, {
  "Id": "17",
  "Title": "Building Editors in the Browser",
  "Time": "4:25 pm",
  "Speaker": "Jason Chen",
  "SpeakerProfilePic": "img/speakers/jason-chen.jpg",
  "Resumen": "Building Editors in the Browser"
}, {
  "Id": "18",
  "Title": "Break",
  "Time": "4:45 pm",
  "Speaker": "Break",
  "SpeakerProfilePic": "img/icon.png",
  "Resumen": ""
}, {
  "Id": "19",
  "Title": "JavaScript Robotics: A NodeBots show",
  "Time": "5:20 pm",
  "Speaker": "Julian Duque",
  "SpeakerProfilePic": "img/speakers/julian-duque.jpg",
  "Resumen": "Have you ever heard about NodeBots? In this talk (or show) you are going to learn about what a NodeBot is and how it's possible to do some electronics and robotics magic using JavaScript, from basics projects like controlling a LED to more advanced ones like a biped robot or crazy musical instruments like a theremin. Besides the cool things you can build in NodeBots the most awesome part of it is the community, you'll see what we are doing from the community point of view and how we are achieving social impact bringing more people from all ages to programming and electronics, specially in Latin america, through the NodeBots community."
}, {
  "Id": "20",
  "Title": "Building a Distributed Data Ingestion System with RabbitMQ",
  "Time": "5:45 pm",
  "Speaker": "Álvaro Videla",
  "SpeakerProfilePic": "img/speakers/alvaro-videla.jpg",
  "Resumen": "Your company has servers distributed around the world and you need to process data in a centralised location. The data is produced by applications using different technology stacks and comes from various sources, from web servers to sensors. How could you solve this problem? Enter RabbitMQ. In this talk we are going to show how to build a system that can ingest data produced at separate geo located areas (think AWS and it's many regions) and replicate it to a central cluster where it can be further processed and analysed. We will present an example of how to build a system like this one by using RabbitMQ Federation to replicate data across AWS Regions and RabbitMQ support for many protocols to produce/consume data. To help with scalability we are going to show an interesting way to implement sharded queues with RabbitMQ by using the Consistent Hash Exchange. If you want to learn what else has RabbitMQ to offer beyond simple messaging and queueing, then this is the talk for you."
}, {
  "Id": "21",
  "Title": "Sandboxing Node.js with CoreOS and Docker",
  "Time": "6:10 pm",
  "Speaker": "Tomasz Janczuk",
  "SpeakerProfilePic": "img/speakers/tomasz-janczuk.jpg",
  "Resumen": "You are writing a cloud application that executes custom code on behalf of your users. You need to protect one user's data from another's, and you must ensure fair access to computing resources among your users, without imposing undue constraints on their code. In other words, you must build a sandbox for executing custom code. In this talk I will demonstrate a design for such a sandbox that we have created at Auth0. You will learn how we are using modern container technologies based on CoreOS and Docker to enable customers to run custom Node.js and C# code (via Edge.js) in a way that is safe, fair, and fast."
}, {
  "Id": "22",
  "Title": "j2me.js - a multi-threaded Java VM in JavaScript",
  "Time": "6:30 pm",
  "Speaker": "Andreas Gal",
  "Keynote": "KEYNOTE SPEAKER",
  "SpeakerProfilePic": "img/speakers/andreas-gal.jpg",
  "Resumen": "j2me.js is a Java VM written in pure JavaScript that is geared towards modern Web-enabled mobile devices such as Firefox OS. Its designed to run Java/MIDP games and apps in an HTML5 environment, enabling old feature phone content to live on in the modern smartphone world. My talk will in focus in particular on mapping the more complex language features of the Java VM onto JavaScript and HTML5, including multithreading and synchronous I/O."
}, {
  "Id": "23",
  "Title": "The future of Javascript",
  "Time": "7:15 pm",
  "Speaker": "Brendan Eich",
  "Keynote": "KEYNOTE SPEAKER",
  "SpeakerProfilePic": "img/speakers/brendan-eich.jpg",
  "Resumen": "The future of Javascript"
}]